https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm
https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python

In [ ]:
import pandas as pd
pd.__version__

In [ ]:
import pandas as pd
dataFrame = pd.DataFrame()
print('dataFrame: ', dataFrame, 'type', type(dataFrame))

In [ ]:
import pandas as pd

lists1 =  [10, 11, 12, 13, 14]
df1    =  pd.DataFrame(lists1)
print('DataFrame df1 : ', df1, '\ntype', type(df1))

In [ ]:
import pandas as pd

dict1 =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2    =  pd.DataFrame(dict1)
print('DataFrame df2 : \n', df2, '\ntype', type(df2))

In [ ]:
import numpy  as np
import pandas as pd

tuple1 =  (23, 24, 31, 21, 30)
arr1   =  np.array(tuple1)
df3    =  pd.DataFrame(arr1, columns = ['Age'])
print('DataFrame df3 : \n', df3, '\ntype', type(df3))

In [ ]:
import pandas as pd

dict1  =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2    =  pd.DataFrame(dict1)
df4    =  pd.DataFrame({'Name' : df2['Name'], 'Salary': [25000, 26000, 32000, 21000, 31000]}, columns = ['Name', 'Salary'])
print('DataFrame df4 : \n', df4, '\ntype', type(df4))

In [ ]:
import pandas as pd

dict1          =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2            =  pd.DataFrame(dict1)
address        = ['Chennai', 'Bengalooru', 'Delhi', 'Kolkutta', 'Chennai']
df4            =  pd.DataFrame({'Name' : df2['Name'], 'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                               columns = ['Name', 'Salary'])
df4['Address'] = address
print('DataFrame df4 : \n', df4, '\ntype', type(df4))

In [ ]:
import pandas as pd

dict1          =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2            =  pd.DataFrame(dict1)
address        = ['Chennai', 'Bengalooru', 'Delhi', 'Kolkutta', 'Chennai']
df5            =  pd.DataFrame({'Name' : df2['Name'], 'Age': df2['Age'], \
                                'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                                 columns = ['Name', 'Age', 'Salary'])
del df5['Age']
print('DataFrame df5 : \n', df5, '\ntype', type(df5))

In [ ]:
import pandas as pd

dict1          =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2            =  pd.DataFrame(dict1)
address        = ['Chennai', 'Bengalooru', 'Delhi', 'Kolkutta', 'Chennai']
df5            =  pd.DataFrame({'Name' : df2['Name'], 'Age': df2['Age'], \
                                'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                                 columns = ['Name', 'Age', 'Salary'])

print("DataFrame df5 : \n", df5)

In [ ]:
df5.loc[df5['Age'] < 30,'Age']

In [ ]:
print('\ndf5.iloc[1]: \n', df5.iloc[1])('df5 ', df5)

In [ ]:
df5[1:4]

In [ ]:
import pandas as pd

df1 = pd.DataFrame({'Name' : ['Arun', 'Alex', 'Ajay'], 'Age' : [20, 24, 25]}, columns = ['Name', 'Age'])
df2 = pd.DataFrame({'Name' : ['Bob', 'Bret', 'Bennert'], 'Age' : [25, 26, 28]}, columns = ['Name', 'Age'])
df  = df1.append(df2)
print('\ndf1: \n', df1)
print('\ndf2: \n', df2)
print('\nAdd df2 at end of df1\n')
print('\ndf: \n', df)

In [ ]:
df3 = df2.drop(2) # delete third row
print('\ndf3: \n', df3)
df4 = df2.drop(columns = 'Age') # delete a column, Age
print('\ndf4: \n', df4)

In [ ]:
import pandas as pd

ser1 = pd.Series([10, 11, 12, 13, 14])
print('\nser1:\n', ser1)

In [ ]:
ser1.values

In [ ]:
ser1.index

In [ ]:
emp_name = ['Arun', 'Alex', 'Ajay']
emp_id   = ['E101', 'E102', 'E103']
ser2 = pd.Series(emp_name, index = emp_id)
print('\nser2:\n',ser2)

In [ ]:
print('Values\n',ser2.values)
print('Index\n',ser2.index)

In [ ]:
print('\nSelect Name corresponding to E103\n', ser2['E103'])
print('\nSelect Name corresponding to E102 and E103\n', ser2[['E102','E103']])

In [ ]:
emp_id   = ['E101', 'E102', 'E103']
emp_age  = [ 23, 45, 59]
ser3 = pd.Series(emp_age, index = emp_id)

print('select empid with age < 40\n', ser3[ser3 < 40])

In [ ]:
print('\ncheck if the E102 exists in ser3\n', 'E102' in ser3)

In [ ]:
emp_dict = {'Arun' : 23, 'Alex' : 45, 'Ajay' : 59}
ser4     =  pd.Series(emp_dict)
ser4

In [ ]:
index_labels = ['Ajay', 'Arun', 'Alex']
emp_dict     = {'Arun' : 23, 'Alex' : 45, 'Ajay' : 59}
ser5         = pd.Series(emp_dict, index = index_labels)
ser5

In [ ]:
index_labels = ['Ajay', 'Arun', 'Alex','Bob'] # No value  for Bob
emp_dict     = {'Arun' : 23, 'Alex' : 45, 'Ajay' : 59}
ser6         = pd.Series(emp_dict, index = index_labels)
ser6

In [ ]:
ser6.isnull()

In [ ]:
ser6.notnull()

In [ ]:
student_dict  = {'Arun' : 23.0, 'Alex' : 45.0, 'Ajay' : 59.0}
student_dict1 = {'Arun' : 33.0, 'Alex' : 35.0,'Bob' : 38.0, 'Bert' : 40.0, 'Ben' : 37.0}
ser6     =  pd.Series(student_dict)
ser7     =  pd.Series(student_dict1)
print(ser6)
print(ser7)

In [ ]:
print(ser6 + ser7)

In [ ]:
ser = ser6 + ser7
ser.index.name = 'Marks'
ser

In [ ]:
ser.index = ['Ajay', 'Alex', 'Arun', 'Ben', 'Caren', 'Chaplin']
ser

In [ ]:
import pandas as pd

emp_name = ['Arun', 'Alex', 'Ajay']
emp_id   = ['E101', 'E102', 'E103']
ser0 = pd.Series(emp_name)
print('\nser0:\n',ser0)

In [ ]:
ser0.index = emp_id
ser0.index.name = 'EmpID'
print('\nser0:\n',ser0)

In [ ]:
import pandas as pd

dict1          =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2            =  pd.DataFrame(dict1)
address        = ['Chennai', 'Bengalooru', 'Delhi', 'Kolkutta', 'Chennai']
df5            =  pd.DataFrame({'Name' : df2['Name'], 'Age': df2['Age'], \
                                'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                                 columns = ['Name', 'Age', 'Salary'])

print("DataFrame df5 : \n", df5)

In [ ]:
df5.set_index('Name', inplace = True)
df5

In [ ]:
import pandas as pd

dict1          =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'], 'Age' : [23, 24, 31, 21, 30]}
df2            =  pd.DataFrame(dict1)
address        = ['Chennai', 'Bengalooru', 'Delhi', 'Kolkutta', 'Chennai']
df5            =  pd.DataFrame({'Name' : df2['Name'], 'Age': df2['Age'], \
                                'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                                 columns = ['Name', 'Age', 'Salary'])

print("DataFrame df5 : \n", df5)
df5.set_index('Name', inplace = True, drop = False)
df5

In [ ]:
import pandas as pd

dict1          =  {'Name' : ['Arun', 'Alex', 'Babu','Charlee','David']}
df2            =  pd.DataFrame(dict1)
index          = df2['Name']
df5            =  pd.DataFrame({'Name' : df2['Name'], 'Age': [23, 32, 25, 31, 32], \
                                'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                                 columns = ['Age', 'Salary'],\
                                 index   = index)

In [ ]:
df5

In [ ]:
df5.reset_index()

In [ ]:
import pandas as pd

df             =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David'],\
                                'Age': [23, 32, 25, 31, 32], \
                                'Salary': [25000, 26000, 32000, 21000, 31000]}, \
                                 columns = ['Name', 'Age', 'Salary'])

In [ ]:
#reindex the DataFrame
df_reindexed = df.reindex(index=[0,2,1], columns=['Name', 'Salary', 'Age'])

In [ ]:
df_reindexed

In [ ]:
import pandas as pd

df1              =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David', 'Ebenezer'],\
                                'Age': [23, 24, 25, None, 32, None], \
                                'Salary': [25000, 26000, 27000, 27500, 31000, 34000]}, \
                                 columns = ['Name', 'Age', 'Salary'])

In [ ]:
print('\nBefore ffill\n')
print(df1)

In [ ]:
ranges = range(6)
df1.reindex(ranges, method = 'ffill', limit = 3, fill_value = 'NaN')

In [ ]:
df = pd.DataFrame({"A":[1, 5, 3, 4, 2], 
                   "B":[3, 2, 4, 3, None], 
                   "C":[2, 2, 7, 3, 4], 
                   "D":[4, 3, 6, 12, 7]}, 
                   index =["first", "second", "third", "fourth", "fifth"])

In [ ]:
df.reindex(columns =["A", "B", "D", "E"], method = 'bfill', fill_value = 'NaN')

In [ ]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.arange(16).reshape(4,4), index=['a','b','c', 'd'],\
                   columns=['Ohio','Texas','California', 'New York'])
print('\nBefore renaming\n')
print(df1)

In [ ]:
df1.rename(columns = {'Ohio' :'Texas', 'Texas':'Utah', 'California' : 'Conneticut', \
                      'New York' : 'New Jersey'},\
           index = {'a' : 'Number of Homicides', 'b' : 'Number of Robbery', \
                    'c' : 'Number of Thefts', 'd' : 'Non-criminal offenses'},\
          inplace = True)
print ("After renaming the rows and columns:")
print(df1)

In [1]:
import pandas as pd

df1              =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David', 'Ebenezer'],\
                                'Age': [23, 24, 25, None, 32, None], \
                                'Salary': [25000, 26000, 27000, 27500, 31000, 34000]}, \
                                 columns = ['Name', 'Age', 'Salary'])
print(df1)

       Name   Age  Salary
0      Arun  23.0   25000
1      Alex  24.0   26000
2      Babu  25.0   27000
3   Charlee   NaN   27500
4     David  32.0   31000
5  Ebenezer   NaN   34000

In [ ]:
df1.loc[df1.Age < 30, ['Name', 'Age', 'Salary']]

In [ ]:
df1.iloc[1]

In [ ]:
df1.ix[1]

In [ ]:
df1.ix[2,'Name'] # to second third row column Name

In [ ]:
frame1 = frame1.reindex(index=['a','b','c','d'], method='ffill')
frame1.columns = sorted(states)

	
	head() 
	tail() returns the last n rows, 5 is the default

In [2]:
df1.axes # returns a list of the row axis labels

[RangeIndex(start=0, stop=6, step=1),
 Index(['Name', 'Age', 'Salary'], dtype='object')]

In [3]:
df1['Age'].dtype #  returns the data type of the object

dtype('float64')

In [5]:
df1.empty  # returns True if the given object is empty

False

In [7]:
df1.ndim # returns the number of dimensions of the underlying obje

2

In [8]:
df1.size # size() returns the number of elements in the underlying object

18

In [9]:
print('\nFirst 5 rows\n')
print(df1.head()) # returns the first n rows, 5 is the default
print('\nFirst 5 rows with rows and columns interchanged \n')
print(df1.head().T) # returns the first n rows, 5 is the default

First 5 rows

      Name   Age  Salary
0     Arun  23.0   25000
1     Alex  24.0   26000
2     Babu  25.0   27000
3  Charlee   NaN   27500
4    David  32.0   31000

First 5 rows with rows and columns interchanged

            0      1      2        3      4
Name     Arun   Alex   Babu  Charlee  David
Age        23     24     25      NaN     32
Salary  25000  26000  27000    27500  31000

In [10]:
print('\nLast 5 rows\n')
print(df1.tail()) # returns the first n rows, 5 is the default
print('\nLast 5 rows with rows and columns interchanged \n')
print(df1.tail().T) # returns the first n rows, 5 is the default

Last 5 rows

       Name   Age  Salary
1      Alex  24.0   26000
2      Babu  25.0   27000
3   Charlee   NaN   27500
4     David  32.0   31000
5  Ebenezer   NaN   34000

Last 5 rows with rows and columns interchanged

            1      2        3      4         5
Name     Alex   Babu  Charlee  David  Ebenezer
Age        24     25      NaN     32       NaN
Salary  26000  27000    27500  31000     34000

1. count() returns the number of non-null observations
2. sum() returns the sum of values
3. min() 
4.  max() returns the maximum value
5.  abs() returns the absolute value
6.  prod() returns the product of values
7.  cumsum() returns the cumulative sum of values
8.  cumprod() returns the cumulative product of values
9. mean() returns the arithmetic mean of values
10. median() returns the median of values
11. mode() returns the mode of values
12. std() returns the standard deviation of values

In [13]:
df1.count() # returns the number of non-null observations

Name      6
Age       4
Salary    6
dtype: int64

In [15]:
 df1[['Age','Salary']].sum() #returns the sum of values

Age          104.0
Salary    170500.0
dtype: float64

In [16]:
 df1[['Age','Salary']].min()#returns the minimum value

Age          23.0
Salary    25000.0
dtype: float64

In [17]:
 df1[['Age','Salary']].max()#returns the maximum value

Age          32.0
Salary    34000.0
dtype: float64

In [18]:
 df1[['Age','Salary']].abs() #returns the absolute value

    Age   Salary
0  23.0  25000.0
1  24.0  26000.0
2  25.0  27000.0
3   NaN  27500.0
4  32.0  31000.0
5   NaN  34000.0

In [20]:
df2 = pd.DataFrame({'Value' : [10, -11, 12, 13, 14]})
df2.Value.abs() #returns the absolute value

0    10
1    11
2    12
3    13
4    14
Name: Value, dtype: int64

In [21]:
df2 = pd.DataFrame({'Value' : [10, -11, 12, 13, 14]})
df2.Value.prod() # returns the product of values

-240240

In [25]:
df2 = pd.DataFrame({'Value' : [10, -11, 12, 13, 14]})
df2.cumsum() #  returns the cumulative sum of values

   Value
0     10
1     -1
2     11
3     24
4     38

In [26]:
df2 = pd.DataFrame({'Value' : [10, -11, 12, 13, 14]})
df2.cumprod() # cumprod() returns the cumulative product of values

    Value
0      10
1    -110
2   -1320
3  -17160
4 -240240

In [27]:
import pandas as pd

df1              =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David', 'Ebenezer'],\
                                'Age': [23, 24, 25, None, 32, None], \
                                'Salary': [25000, 26000, 27000, 27500, 31000, 34000]}, \
                                 columns = ['Name', 'Age', 'Salary'])
print(df1)

       Name   Age  Salary
0      Arun  23.0   25000
1      Alex  24.0   26000
2      Babu  25.0   27000
3   Charlee   NaN   27500
4     David  32.0   31000
5  Ebenezer   NaN   34000

In [28]:
df1.Salary.mean() # returns the arithmetic mean of values

28416.666666666668

In [29]:
df1.Salary.median() # returns the median of values

27250.0

In [39]:
import pandas as pd

df2              =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David', 'Ebenezer'],\
                                'Age': [23, 24, 25, None, 32, None], \
                                'Salary': [25000, 25000, 25000, 27500, 31000, 34000]}, \
                                 columns = ['Name', 'Age', 'Salary'])
print(df2)
print('\nMode: %d'% df2.Salary.mode()[0]) # returns the mode of values

       Name   Age  Salary
0      Arun  23.0   25000
1      Alex  24.0   25000
2      Babu  25.0   25000
3   Charlee   NaN   27500
4     David  32.0   31000
5  Ebenezer   NaN   34000

Mode: 25000

In [42]:
import pandas as pd

df2              =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David', 'Ebenezer'],\
                                'Age': [23, 24, 25, None, 32, None], \
                                'Salary': [25000, 25000, 25000, 27500, 31000, 34000]}, \
                                 columns = ['Name', 'Age', 'Salary'])
print(df2)
print('\nStandard Deviation : %f'% df2.Salary.std()) # returns the mode of values

       Name   Age  Salary
0      Arun  23.0   25000
1      Alex  24.0   25000
2      Babu  25.0   25000
3   Charlee   NaN   27500
4     David  32.0   31000
5  Ebenezer   NaN   34000

Standard Deviation : 3800.219292

In [43]:
import pandas as pd

df2              =  pd.DataFrame({'Name' : ['Arun', 'Alex', 'Babu','Charlee','David', 'Ebenezer'],\
                                'Age': [23, 24, 25, None, 32, None], \
                                'Salary': [25000, 25000, 25000, 27500, 31000, 34000]}, \
                                 columns = ['Name', 'Age', 'Salary'])

In [47]:
df3 = pd.DataFrame({'Name' : ['A', 'A', 'A', 'C', 'B'], 'Value' : [1, 10, 12, 14, 90]})
print('\nNumeric columns\n')
print(df3.describe())
print('\nNon Numeric columns\n')
print(df3.describe(include = ['object']))

Numeric columns

           Value
count   5.000000
mean   25.400000
std    36.452709
min     1.000000
25%    10.000000
50%    12.000000
75%    14.000000
max    90.000000

Non Numeric columns

       Name
count     5
unique    3
top       A
freq      3

In [45]:
print(df2.describe())

             Age        Salary
count   4.000000      6.000000
mean   26.000000  27916.666667
std     4.082483   3800.219292
min    23.000000  25000.000000
25%    23.750000  25000.000000
50%    24.500000  26250.000000
75%    26.750000  30125.000000
max    32.000000  34000.000000

In [46]:
print(df2.describe(include = ['object']))

        Name
count      6
unique     6
top     Arun
freq       1

In [48]:
df3 = pd.DataFrame({'Name' : ['A', 'A', 'A', 'C', 'B'], 'Value' : [1, 10, 12, 14, 90]})
print('\n Summary of data frame\n')
print(df3.info())

 Summary of data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
Name     5 non-null object
Value    5 non-null int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes
None

https://pandas-tutorial.com/

https://www.edureka.co/blog/python-pandas-tutorial/

https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/